Revit 2027 API
BuiltInFailures.StairRampFailures.FailToReOrientSketchCurvesFailure Property
 Failed to orient sketch curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToReOrientSketchCurvesFailure { get; }
Public Shared ReadOnly Property FailToReOrientSketchCurvesFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToReOrientSketchCurvesFailure {
	FailureDefinitionId^ get ();
}
static member FailToReOrientSketchCurvesFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace